app/controllers/articles_controller.rb

SELECT * FROM `articles`
---
  def index
    @articles = Article.all

SELECT * FROM `articles` WHERE (`articles`.`id` = 1)
---
  def show
    @article = Article.find(params[:id])

SELECT * FROM `articles` WHERE (`articles`.`id` = 3)
---
  def edit
    @article = Article.find(params[:id])

INSERT INTO `articles` (`name`, `created_at`, `delta`, `updated_at`, `description`) VALUES('Neovasolution', '2010-07-14 12:17:16', 1, '2010-07-14 12:17:16', 'This is pune company')
---
  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save

SELECT * FROM `articles` WHERE (`articles`.`id` = 1)
DELETE FROM `articles` WHERE `id` = 1
---
  def destroy
    @article = Article.find(params[:id])
    @article.destroy