app/controllers/cars_controller.rb

  def index
    @cars = Car.all
---
SELECT * FROM `cars`

  def show
    @car = Car.find(params[:id])
---
SELECT * FROM `cars` WHERE (`cars`.`id` = 1)

  def create
    @car = Car.new(params[:car])
    if @car.save
---
INSERT INTO `cars` (`brand`, `name`, `created_at`, `updated_at`) VALUES('Tata', 'indigo', '2010-08-04 07:45:49', '2010-08-04 07:45:49')